/* —оздать консольное приложение, удовлетвор€ющее следующим требовани€м:
 *  орректно спроектируйте и реализуйте предметную область задачи.
 * ƒл€ создани€ объектов из иерархии классов продумайте возможность использовани€ порождающих шаблонов
 * проектировани€.
 * –еализуйте проверку данных, вводимых пользователем, но не на стороне клиента.
 * дл€ проверки корректности переданных данных можно применить регул€рные выражени€.
 * ћеню выбора действи€ пользователем можно не реализовывать, используйте заглушку.
 * ќсобое условие: переопределите, где необходимо, методы toString(), equals() и hashCode().
 * ¬ариант A. ÷веточна€ композици€. –еализовать приложение, позвол€ющее создавать цветочные композиции
 * (объект, представл€ющий собой цветочную композицию). —оставл€ющими цветочной композиции €вл€ютс€ цветы
 * и упаковка.
 * ¬ариант B. ѕодарки. –еализовать приложение, позвол€ющее создавать подарки (объект, представл€ющий собой
 * подарок). —оставл€ющими целого подарка €вл€ютс€ сладости и упаковка.
 */
package by.epam.jo_05_01_05.main;

public class Main {

	public static void main(String[] args) {
		// TODO Auto-generated method stub

	}

}
